## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_route53_record.design-system-alpha-canada-ca-NS`     |
|        | `aws_route53_record.systeme-design-alpha-canada-ca-NS`    |
| delete | `aws_route53_record.design-system-alpha-canada-ca-CNAME`  |
|        | `aws_route53_record.systeme-design-alpha-canada-ca-CNAME` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.design-system-alpha-canada-ca-CNAME will be destroyed
  # (because aws_route53_record.design-system-alpha-canada-ca-CNAME is not in configuration)
  - resource "aws_route53_record" "design-system-alpha-canada-ca-CNAME" {
      - fqdn                             = "design-system.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_design-system.alpha.canada.ca_CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "design-system.alpha.canada.ca" -> null
      - records                          = [
          - "cds-design-snc.netlify.app",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
    }

  # aws_route53_record.design-system-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "design-system-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "design-system.alpha.canada.ca"
      + records         = [
          + "ns-1282.awsdns-32.org",
          + "ns-1553.awsdns-02.co.uk",
          + "ns-299.awsdns-37.com",
          + "ns-527.awsdns-01.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.systeme-design-alpha-canada-ca-CNAME will be destroyed
  # (because aws_route53_record.systeme-design-alpha-canada-ca-CNAME is not in configuration)
  - resource "aws_route53_record" "systeme-design-alpha-canada-ca-CNAME" {
      - fqdn                             = "systeme-design.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_systeme-design.alpha.canada.ca_CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "systeme-design.alpha.canada.ca" -> null
      - records                          = [
          - "cds-design-snc.netlify.app",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
    }

  # aws_route53_record.systeme-design-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "systeme-design-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "systeme-design.alpha.canada.ca"
      + records         = [
          + "ns-1302.awsdns-34.org",
          + "ns-1850.awsdns-39.co.uk",
          + "ns-316.awsdns-39.com",
          + "ns-785.awsdns-34.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
